[{ "ID": "1", "Titre": "Les sucres du grand Khong", "Probleme": "Tjiuuuuu trrrrrr kluk... Vous voici sur un étrange balkhong recouvert de flokhongs. Un Gaskhong au teint rubikhong avec un faukhong sur l'épaule boit goulûment à même un flakhong de cristal. Puis il vous tend un document abskhong...\r\n\r\n\r\nTous les matins, le grand Khong mettait exactement sept sucres et demi dans son café au lait. Ce n'est pourtant pas qu'il eût un goût particulier pour le sucre. Son médecin lui avait d'ailleurs formellement déconseillé le sucre, qui était mauvais pour son diabète. Il lui avait également déconseillé le café, qui faisait monter sa tension, le lait, qui lui donnait du cholestérol (en fait le médecin n'avait pas vraiment dit \"diabète\" ni \"cholestérol\", mais là, on vous fait une version doublée et colorisée), et des tas d'autres choses sous les prétextes les plus divers, si bien que le grand Khong l'avait fait exécuter. Ça l'avait d'ailleurs beaucoup amusé (le grand Khong, pas le médecin), et ça tombait bien vu qu'il (le médecin) lui avait recommandé de rire souvent (au grand Khong), car c'était bon pour son coeur et arrêtez de m'interrompre tout le temps.\r\n\r\n\r\nMais en ces temps reculés et en ces lieux incertains, le sucre était une denrée rare et chère, considérée comme un attribut de pouvoir et une preuve de noblesse. Le grand Khong se devait de tenir son rang et avait donc décoré sa salle à manger avec 666 boîtes de sucre, que des serviteurs étaient chargés de maintenir pleines en permanence. Histoire de leur compliquer un peu la vie, il tirait au sort chaque matin (avec un dé à 666 faces) le numéro de la boîte où il prenait ses sucres. Si elle ne contenait que des sucres entiers, il en cassait un en deux et remettait la moitié restante dans la boîte ; si elle contenait déjà un demi-sucre, il le prenait. Quand ils remplissaient la boite, les serviteurs avaient pour instruction de laisser le demi- sucre, s'il y en avait un dans la boite, sur le dessus. Le grand Khomptable avait pour mission de superviser le travail des serviteurs, afin d'éviter qu'il ne dérobassent un demi-sucre, voire un morceau entier, on ne peut vraiment faire confiance à personne.\r\nUn jour, il fit remarquer au grand Khong : « Tiens, c'est amusant, il y a exactement 111 demi- sucres dans les boîtes. » Le grand Khong le gratifia d'un regard vitreux : il ne voyait pas ce que ça pouvait avoir d'amusant. Sauf que « amusant » lui rappelait son médecin, et que justement ça lui donnait des idées pour le grand Khomptable.\r\n\r\nInterprétant sans doute mal la lueur d'intérêt qui illumina alors le visage du grand Khong, le grand Khomptable continua. : \"Oui, parce qu'au début, il n'y avait pas de demi-sucre. Le soir du premier jour, il y en avait un c'est sûr. Le soir du deuxième jour, il pouvait y en avoir deux, le troisième jour jusqu'à trois, etc. D'ailleurs c'est un problème particulièrement amusant. Par exemple, le soir du 123456789\\up{ème} jour, la probabilité pour qu'il y ait exactement 333 demi-sucres sera de...\" Là, le grand Khomptable s'arrêta net. La répétition du mot \"amusant\" avait définitivement sorti le grand Khong de sa torpeur, et le sourire cruel qu'il arborait à présent laissait peu de place au doute quant à ses intentions... \"Bon ce n'est pas le tout, j'ai un tas de blé dans la cour...\" lâcha le grand Khomptable alors qu'il refermait déjà la porte derrière lui. C'est bien connu, la prudence est une des premières qualités de tout Khomptable.\r\n\r\n\r\n\r\nQuelle est la probabilité pour qu'au soir du 123 456 789\\up{ème} jour, les 666 boites du grand Khong contiennent un nombre de demi-sucres (déjà coupés, donc) valant exactement 333 ? Et le soir du 1 234 567 890\\up{ème} jour ?\r\n\r\n(source : \\l[http:\/\/www.enigmyster.com\/]{Enigmyster})", "Solution": "\\section{Prologue}\r\n\r\nLe problème des sucres du Grand Khong peut est décrit de manière alternative selon une allégorie mystico-sibylline du ploutocrate sortant d'un pandémonium de sybarites dévoyés où il a croisé quelque échanson dionysiaque, et qui cherche à rejoindre bon an mal an son gynécée.\r\nModélisation :\r\n\r\n\\textss{point A = pandémonium, point B = gynécée, distance de A à B = 666 m}.\r\n\r\nÀ chaque mètre parcouru, le ploutocrate se pose le problème cornélien suivant : doit-il faire un mètre en avant ou un mètre en arrière ? Le choix est fait au hasard. La question posée est la suivante : en lui imposant la règle de rebrousser chemin dès que l'un des deux points $A$ et $B$ est atteint (il oscille donc entre $A$ et $B$ ), quelle est la probabilité que le ploutocrate se trouve à 333m de $A$ (ou de $B$) au bout de 123456789 pas (d'un mètre) ? au bout de 1234567890 pas ?\r\n(\\i{NDLR : la réponse à la deuxième question est triviale ! En revanche, celle de la première l'est nettement moins...})\r\n\r\nC'est la célèbre marche aléatoire du dipsomane impénitent (i.e. ivrogne) ou du périssodactyle capricant (i.e. bourrin), ou encore du sphéniscidé claudiquant (i.e. manchot)... Dans le cas de la marche aléatoire classique, les probabilités d'aller en avant ou en arrière sont constantes au cours du temps. Dans notre problème, elles dépendent de la position du ploutocrate au $k^e$ pas :\r\n\r\n\\item Probabilité de se mouvoir en avant : $\\frac{k}{N}$ ;\r\n\\item Probabilité de se mouvoir en arrière : $1 - \\frac{k}{N}$.\r\n\r\nIl s'agit du modèle d'urnes d'Ehrenfest (utilisé en thermodynamique pour étudier les échanges thermiques), c'est une chaîne de Markov célèbre.\r\n\r\n\\section{La solution du problème du Grand Khong}\r\n\\l[Ressources\/Defis_Sucres.pdf]{Voir la solution du problème des sucres du grand Khong (fichier PDF)}" }, { "ID": "2", "Titre": "Les dés schtroumpfés", "Probleme": "Le pays des schtroumpfs est actuellement secoué par une agitation peu courante...\r\n\r\nSur la table centrale du village sont disposés 4 dés, tout ce qu'il y a de plus courant, dont voici les patrons :\r\n\\image[Le patron des dés D'Efron]{http:\/\/lachal.neamar.fr\/Ressources\/Des.gif}\r\n\r\nLe schtroumpf gourmand a défié le schtroumpf pâtissier :\r\n\"Schtroumpf pâtissier, je te laisse choisir un dé. Je choisirai un autre schtroumpf juste après, et nous lancerons nos dés respectifs. Si je fais le plus grand schtroumpf, tu me donneras un gâteau à la salsepareille. Si tu fais un plus grand schtroumpf que moi, alors je te rendrai un gâteau. En cas d'égalischtroumpf, personne ne gagnera ou ne perdra de gâteaux.\r\nNous lancerons nos dés très longschtroumpf, disons une infinischtroumpf de fois.\"\r\n\r\nLe schtroumpf pâtissier se met alors à activer toutes ses synapses : \"Mon but est bien évidemment de garder tous mes gâteaux ! Quel dé dois-je choisir pour ne pas nourrir ad vitam eternam ce rusé schtroumpf gourmand ?\"\r\n\r\nCette réflexion fort légitime du schtroumpf pâtissier est interrompue par le schtroumpf à lunettes, qui a une objection elle aussi fort judicieuse : \"Ce n'est pas schtroumpf ! Le schtroumpf gourmand n'a pas de gâteaux au départ. Il a donc tout à gagner, tandis que le schtroumpf pâtissier ne peut que perdre. Or le grand schtroumpf nous a dit de ne pas faire d'échanges inégaux, parce que ce n'est pas bien et que...\"\r\n\r\nCette diatribe dithyrambique, interrompue juste à point par le schtroumpf costaud, semble cependant légitime : déjà, tout le village commence à huer le pauvre schtroumpf gourmand... qui se sent dès lors obligé d'ajouter des clauses au contrat initial :\r\n\"Nous tiendrons le compte des points sur un papier (\\i{NDLR : un papier très long, puisque le nombre de tirage sera, faut-il le rappeler, infini...}), et si à la fin mon schtroumpf est négatif, alors je m'engage à schtroumpfer pour le schtroumpf pâtissier autant de journées que mon compte est négatif.\"\r\n\r\nSoulagés, les habitants du village retournent leurs visages vers le schtroumpf pâtissier, lequel est en proie aux affres du doute : quel dé doit-il prendre pour gagner un employé ?\r\n\r\nNe laissez pas le schtroumpf pâtissier dans cet état ! Un coup de main lui serait bienvenu...\r\n\r\nQuel dé choisiriez-vous ? Et surtout, pourquoi ?\r\n\r\n(ce problème est librement inspiré des dés dits \"d'Efron\")", "Solution": "(\\i{\\l[http:\/\/lachal.neamar.fr\/Ressources\/Schtroumpf.pdf]{Cette solution est disponible au format PDF}, plus propre que cette version HTML})\r\n\r\n\\section{Prologue}\r\n\r\nNotons $D_1$ le dé immatriculé 0,0,4,4,4,4, $D_2$ celui immatriculé 3,3,3,3,3,3, $D_3$ celui immatriculé 2,2,2,2,6,6, $D_4$ celui immatriculé 1,1,1,5,5,5.\r\nFaisons la taxinomie exhaustive (allez hop ! une petite périssologie pour démarrer...) des confrontations dé à dé.\r\n\r\n\\begin{itemize}\r\n\\li Si Schtroumpf pâtissier choisit le dé $D_1$ :\r\n\t$\\mbox{Prob}(D_2\\mbox{ bat }D_1)=\\frac13$, $\\mbox{Prob}(D_3\\mbox{ bat }D_1)=\\frac59$, $\\mbox{Prob}(D_4\\mbox{ bat }D_1)=\\frac23$ ;\r\n\\li si Schtroumpf pâtissier choisit le dé $D_2$ :\r\n\t$\\mbox{Prob}(D_1\\mbox{ bat }D_2)=\\frac23$, $\\mbox{Prob}(D_3\\mbox{ bat }D_2)=\\frac13$, $\\mbox{Prob}(D_4\\mbox{ bat }D_2)=\\frac12$ ;\r\n\\li si Schtroumpf pâtissier choisit le dé $D_3$ :\r\n\t$\\mbox{Prob}(D_1\\mbox{ bat }D_3)=\\frac49$, $\\mbox{Prob}(D_2\\mbox{ bat }D_3)=\\frac23$, $\\mbox{Prob}(D_4\\mbox{ bat }D_3)=\\frac13$;\r\n\\li si Schtroumpf pâtissier choisit le dé $D_4$ :\r\n\t$\\mbox{Prob}(D_1\\mbox{ bat }D_4)=\\frac13$, $\\mbox{Prob}(D_2\\mbox{ bat }D_4)=\\frac12$,  $\\mbox{Prob}(D_3\\mbox{ bat }D_4)=\\frac23$.\r\n\\end{itemize}\r\n\r\nOn constate que dans tous les cas, Schtroumpf gourmand a l'avantage de pouvoir choisir un dé lui permettant de se goinfrer avec une probabilité $p=\\frac23>\\frac12$.\r\nVoilà un jeu qui relève de l'iniquité la plus abjecte pour notre pauvre hère Schtroumpf pâtissier...\r\n\r\nUne alternative pour endiguer les affres endémiques du Schtroumpf pâtissier serait de se livrer à une suite inextinguible de jeux de dé suivant les mêmes conditions.\r\nQuel Schtroumpf cet exutoire va-t-il rendre exsangue tout en sachant que notre Schtroumpf pâtissier est une descendance de la chèvre Amalthée (la corne d'abondance immarscecible de l'Univers...) ?\r\nLa réponse juste après la section suivante.\r\n\r\n\\section{Modélisation du problème}\r\n\\subsection{Première modélisation}\r\n\r\nLes Schtroumpfs se livrent à une succession de jeux de dé illimitée avec, à chaque coup, une probabilité  $p=\\frac23$ de gain pour l'infâme Schtroumpf gourmand, à l'instar d'une succession de pile ou face avec une pièce schtroumpfée.\r\n\r\n\\item  À l'issue d'un jeu gagnant (avec probabilité $p=\\frac23$), Schtroumpf gourmand gagne un gâteau.\r\n\\item À l'issue d'un jeu perdant (avec probabilité $q=\\frac13$), soit Schtroumpf gourmand avait des gâteaux et il en rend un au Schtroumpf pâtissier, soit il n'a plus de gâteaux et dans ce cas il doit au Schtroumpf pâtissier une journée de plonge. On pourrait assimiler avec un peu d'imagination (si si) cette perte de patisserie ou journée de plonge à un gâteau \"négatif\".\r\n\r\nOn note $X_n=+1$ dans le cas d'un jeu gagnant et $X_n=-1$ dans le cas d'un jeu perdant.\r\n\r\nPosons ensuite $S_n=X_1+\\dots+X_n$ ; $S_n$ représente le nombre de gâteaux (« positifs » et « négatifs » !) gagnés par Schtroumpf gourmand au bout de $n$ jeux.\r\nPour les Schtroumpfs initiés, la variable aléatoire $S_n$ suit la loi binomiale de paramètres $n$ et $p$ et la suite $(S_n)_{n \\in \\mathbb{N}}$ est la célèbre marche aléatoire du dipsomane impénitent ou de l'onagre claudiquant (je me répète, mais bis repetita placent...).\r\n\r\n\\subsection{Deuxième modélisation}\r\n\r\nLe problème associé à la modélisation précédente n'étant pas complètement trivial (à cause de la mixité rendu de gâteau-unité de plonge), la rédaction a délibérément choisi de le simplifier en rajoutant une hypothèse de boulimie : Schtroumpf gourmand, Schtroumpf à la manducation irrépressible, engloutit instantanément chaque gâteau qu'il gagne et donc chaque gâteau qualifié de négatif représente un jour de pensum, Schtroumpf pâtissier ne récupère aucun de ses gâteaux (ce qui n'est pas un problème puisque Amalthée n'est pas loin de la résurrection...).\r\n\r\nEn fait, Schtroumpf gourmand qui se révèle être un croisement entre un Schtroumpf paresseux et un Schtroumpf tire-au-flanc n'est pas prêt à faire indéfiniment le sbire au service du Schtroumpf pâtissier à chaque échec au jeu de dé. En conséquence, on supposera que le nombre de jours de pénitence est fini, disons $b$. Par ailleurs, dans un premier temps, sans volonté d'offusquer la biquette capricante, on supposera que le stock du Schtroumpf pâtissier n'est pas aussi illimité qu'il le prétend : il contient $a$ gâteaux. On fera ensuite tendre $a$ vers l'infini pour honorer le mythe.\r\n\r\nOn définit alors $N_a=\\min\\{n\\ge 1\\,:\\,S_n=a\\}$ et $N_{-b}=\\min\\{n\\ge 1\\,:\\,S_n=-b\\}$.\r\nLe nombre $N_a$ est le numéro du premier jeu à l'issue duquel le stock de gâteaux du Schtroumpf pâtissier est vidé.\r\nLe nombre $N_{-b}$ est le numéro du premier jeu à l'issue duquel Schtroumpf gourmand a obtenu $b$ gâteaux « négatifs », i.e ses $b$ unités de plonge (saturation du pensum).\r\nLa probabilité cruciale du problème est $\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=\\mbox{Prob}(N_a<N_{-b})$.\r\nLe Schtroumpf avisé aura reconnu le célèbre problème de la ruine du joueur : l'inégalité $N_a<N_{-b}$ signifie que le Schtroumpf pâtissier est ruiné (plus de gâteau) avant la saturation en corvée du Schtroumpf gourmand.\r\n\r\n\\section{Résolution du problème}\r\n\r\nAfin de calculer la probabilité $\\mbox{Prob}(N_a<N_{-b})$, on introduit la probabilité intermédiaire $u_i=\\mbox{Prob}(N_a<N_{-b}|S_{n_0}=i)$ en tenant compte de l'état obtenu à l'issue d'un certain $n_0$<sup>ième<\/sup> jeu : on suppose qu'à ce moment Schtroumpf gourmand dispose de $i$ gâteaux (positifs ou négatifs, est-il utile de le rappeler ?!), disons qu'il est dans l'état $i\\in\\{-b,-b+1,...,a-1,a\\}$.\r\nEn fait, $u_i$ ne dépend pas de $n_0$, le dénouement du jeu ne repose que sur le nombre $i$ de gâteaux à un moment donné arbitraire (là, ça sent le Markov à plein nez...). On cherche à calculer $u_0$.\r\n\r\nOn va écrire (qui scribit bis legit) une relation de récurrence pour la suite $(u_i)_{-b\\le i \\le a}$.\r\nSupposons qu'à l'issue du $n_0$<sup>ième<\/sup> jeu, Schtroumpf gourmand soit dans un état $i$.\r\n\r\n\\item Soit il a gagné ($X_{n_0}=+1$ avec probabilité $p$) et alors on avait $S_{n_0-1}=i-1$ i.e il se trouvait antérieurement dans l'état $i-1$ ;\r\n\\item Soit il a perdu ($X_{n_0}=-1$ avec probabilité $q$) et alors $S_{n_0-1}=i+1$ i.e il se trouvait antérieurement dans l'état $i+1$.\r\n\r\n\r\nCette discussion oiseuse mais non alambiquée conduit à la relation, pour $-b<i<a$, $u_i=p \\,\\mbox{Prob}(N_a<N_{-b}|S_{n_0-1}=i-1) + q \\,\\mbox{Prob}(N_a<N_{-b}|S_{n_0-1}=i+1)$.\r\nEn d'autres termes $u_i=p u_{i-1} + q u_{i+1}$ avec $u_a=1$ (si $S_{n_0}=a$, Schtroumpf gourmand a définitivement gagné) et $u_{-b}=0$ (si $S_{n_0}=-b$, il a perdu).\r\n\r\nC'est une récurrence linéaire à trois indices dont l'équation caractéristique est $qr^2-r+p=0$ de solutions $1$ et $\\rho=p\/q$. Comme $p=\\frac23$ et $q=\\frac13$, on a $\\rho\\neq 1$ et l'on sait que la suite recherchée est alors une combinaison linéaire de deux suites géométriques de raison $1$ et $\\rho$ : $u_i=\\lambda\\rho^i+\\mu$.\r\nLes conditions $u_a=1$ et $u_{-b}=0$ fournissent ensuite les équations $\\lambda\\rho^a+\\mu=1$ et $\\lambda\\rho^{-b}+\\mu=0$ donnant $\\lambda=\\frac{1}{\\rho^a-\\rho^{-b}}=\\frac{\\rho^b}{\\rho^{a+b}-1}, \\mu=-\\frac{1}{\\rho^{a+b}-1}$.\r\n\r\nD'où $u_0=\\lambda+\\mu=\\frac{\\rho^b-1}{\\rho^{a+b}-1}=\\frac{q^a(p^b-q^b)}{p^{a+b}-q^{a+b}}$.\r\nLa solution à notre problème est finalement, avec $p=\\frac23$ et $q=\\frac13$, $\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=\\frac{2^b-1}{2^{a+b}-1}$.\r\n\r\n\\begin{itemize}\r\n\\li \\i{Cas d'une munificence de Schtroumpf pâtissier élevée à son pinacle} : faisons tendre à présent $a$ vers $+\\infty$.\r\n\tLa probabilité précédente tend vers 0 : $\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=0$.<\/li>\r\n\\li \\i{Cas d'un Schtroumpf gourmand stakhanoviste} : en revanche, si Schtroumpf gourmand n'était pas si cossard qu'on pourrait le subsumer, on pourrait faire tendre $b$ vers $+\\infty$. Cette fois $\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=\\frac{1}{2^a}$.\r\n\\end{itemize}\r\n\r\n\\i{Bonus track} : si on « bricole » les dés de façon à avoir un jeu équitable, i.e tel que $p=q=\\frac12$, alors l'équation caractéristique utilisée précédemment devient $r^2-2r+1=0$. Elle admet une racine double qui vaut 1 et dans ce cas, la suite recherchée est une suite arithmétique : $u_i=\\lambda i+\\mu$. Les conditions $u_a=1$ et $u_{-b}=0$ fournissent $\\lambda a +\\mu=1$ et $-\\lambda b+\\mu=0$ donnant $\\lambda=\\frac{1}{a+b}$ et $\\mu=\\frac{b}{a+b}$.\r\nEnfin, puisque $u_0=\\mu$, on trouve $\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=\\frac{b}{a+b}$.\r\nEn faisant tendre $a$ vers $+\\infty$, la probabilité précédente tend vers 0 :\r\n$\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=0$ ;\r\net en faisant tendre $b$ vers $+\\infty$, la probabilité précédente tend vers 1 :\r\n$\\mbox{Prob}(\\mbox{Schtroumpf gourmand gagne})=1$." }, { "ID": "3", "Titre": "Mélanges de jetons", "Probleme": "Le problème suivant m'a été soumis par l'un de mes élèves (\\textss{Anthony Tschirhard, INSA de Lyon, 51\\up{ième} promotion}, grand rhétoricien à la verve désopilante) qui a une grande pratique de la magie. Lors d'une représentation sybaritique dans quelque cloaque non fréquentable, il se livre a quelques frasques regrettables : disposant d'une pile de $2n$ jetons dont les $n$ du bas sont verts et les $n$ du haut sont rouges, il divise la pile en deux parties : l'une contenant les $n$ jetons verts, l'autre contenant les $n$ jetons rouges. Avec une dextérité indicible, de sa seule main droite il prend simultanément les deux piles de jetons, puis, dans un élan frénétique et incoercible, procède à un mélange de ces deux dernières pour former une unique pile (de $2n$ jetons) alternant parfaitement jeton rouge et jeton vert. Cette nouvelle pile est divisée à son tour exactement en son milieu donnant deux tas de $n$ jetons et notre démiurge procède à un nouveau mélange intercalant alternativement un jeton de chaque tas pour former une nouvelle pile de $2n$ jetons qu'il recoupe de nouveau en deux piles de $n$ jetons et ainsi de suite.\r\n\r\nAprès plusieurs expériences (pour $n < 8$), notre thaumaturge s'aperçut qu'il retombait au bout d'un certain nombre de tels mélanges sur la pile initiale : les $n$ jetons du bas sont verts et les $n$ du haut sont rouges. Plus frappant encore, en numérotant et ordonnant les jetons, il semblerait que la première fois que l'on retrouve une pile de $n$ jetons verts consécutifs et de $n$ rouges de bas en haut, les jetons soient en fait exactement dans l'ordre initial.\r\n\r\nLes questions cornéliennes qu'il m'a soumises étaient alors les suivantes : étant donnée une pile de $2n$ jetons numérotés $1,2,\\dots,2n-1,2n$ ($n \\in\\mathbb{N}^*$) et superposés de bas en haut dans l'ordre croissant,\r\n\r\n\\item le processus de mélange décrit ci-dessus conduit-il nécessairement au classement initial en un temps fini ?\r\n\\item si oui, peut-on exprimer en fonction de $n$ le nombre minimum de mélanges nécessaires pour retrouver le classement initial ?\r\n\\item si les $n$ premiers jetons sont verts et les $n$ derniers rouges, peut-on arriver au regroupement initial des jetons (la pile du bas constituée de jetons verts, celle du haut de rouges) éventuellement dans le désordre quant à la numérotation ?", "Solution": "{{[REPLACE|in-shuffles|\\b{in-shuffles}]}}\r\n{{[REPLACE|out-shuffles|\\b{out-shuffles}]}}\r\n\r\n(\\i{Ce qui suit est un résumé. L'article complet est disponible au format PDF : \\l[\/Ressources\/Shuffle.pdf]{Quelques mélanges parfaits de cartes}}).\r\n\r\n\\section{Quelques mélanges parfaits de cartes}\r\n\r\nIl s'agit d'un problème classique bien connu du monde de la magie des cartes, la manipulation précédente étant souvent faite avec des cartes à jouer.\r\n\r\nLe jeu habituel de $32$ cartes est privilégié car le nombre $32$ se décompose en $2^5$, ce qui conduit à des propriétés remarquables. Dans la littérature, ce type de problème est abordé sous le vocable anglophone de \"chip-shuffle\" pour les jetons, de \"riffle-shuffle\" pour les cartes et plus précisément de \"in-shuffle\" et de \"out-shuffle\" selon le placement des cartes initiales de chaque paquet lors d'un mélange. Il a été considéré entre autres par le célèbre informaticien et magicien Elmsley en 1957. On trouvera également une large description historique du problème dans la section intitulée \"some history of perfect shuffle\".\r\n\r\nLes in-shuffles et out-shuffles sont des mélanges très proches.\r\nDisposant d'un jeu de cartes que l'on coupe au milieu donnant deux paquets de cartes (un premier et un deuxième), l'in-shuffle du jeu initial consiste à démarrer le processus en plaçant la première carte du bas du premier paquet sur la première carte du bas du deuxième paquet. À l'opposé, l'out-shuffle consiste à démarrer en plaçant la première carte du bas du premier paquet sous la première carte du bas du deuxième paquet. Notons que dans le cas de l'out-shuffle, les première et dernière cartes restent immobiles tout au long de l'expérience.\r\nOn pourra consulter les sites internet Wikipedia et Mathworld pour un recensement de ces divers mélanges ainsi que d'autres.\r\n\r\n\\image[Mélanges de jetons à travers le temps]{\/Ressources\/shuffle.png}\r\nElmsley se posait la question plus complexe : est-il possible de déplacer la carte du dessus du paquet à une position donnée à l'avance à l'aide d'une succession de mélanges de nature in-shuffle ou out-shuffle ? La réponse est positive et il obtint un procédé pour accomplir une telle manipulation. Inversement, est-il possible de faire apparaître une carte donnée dans le jeu sur le haut du paquet de cartes, voire à une place quelconque selon un précédé similaire ? Récemment, les mathématiciens Diaconis et Graham (le premier auteur est également magicien) ont répondu positivement à la question générale du déplacement d'une carte donnée vers une position donnée. Ils ont proposé un algorithme indiquant le chemin à suivre (succession de \\b{in-} et out-shuffles).\r\n\r\nReprenons les questions posées par mon élève.\r\nLa réponse à la première question est affirmative et la raison en est très simple.\r\nSommairement, on travaille dans un groupe fini de permutations, on revient donc à la position initiale au bout d'un nombre fini d'expériences, il s'agit d'un processus périodique.\r\n\r\nLa réponse à la deuxième question est également affirmative ; c'est un calcul de période et une formule implicite est disponible, voir e.g. les livres de Conway & Guy, de Herstein & Kaplansky, ou d'Uspensky & Heaslet. Néanmoins, une formule explicite ne semble pas accessible excepté pour les cas particuliers où $n$ est une puissance de $2$ à $\\pm 1$ près.\r\nLa troisième question semble rester à ma connaissance ouverte.\r\n\r\nDans cet article, je détaille le processus de l'in-shuffle - celui de l'out-shuffle s'en déduisant aisément - à l'aide de permutations de l'ensemble $\\{0,1,2,\\dots,2n-1\\}$ ou $\\{1,2,3,\\dots,2n\\}$. L'un des deux ensembles sera d'une utilisation plus commode que l'autre selon le cas étudié. Les permutations associées à $\\{0,1,2,\\dots,2n-1\\}$ sont particulièrement bien adaptées au calcul explicite des itérations successives (correspondant à la succession de mélanges parfaits) par le truchement des écritures binaires.\r\n\r\nAussi, je détaille toutes les permutations relatives aux deux numérotations en signalant laquelle permet de formuler le plus simplement possible la période recherchée. Je porte un intérêt particulier aux cas spécifiques mentionnés plus haut, à savoir lorsque $n$ est une puissance de $2$ à $\\pm 1$ près.\r\nJ'examine également d'autres exemples de mélanges parfaits : les mélanges de Monge qui sont des \\b{in}\/out-shuffles déformés par une symétrie.\r\nToute cette analyse permet d'accéder au calcul des périodes de chacun des mélanges décrits ici.\r\n\r\nPar souci d'homogénéité des notations, on notera $f,g,h,\\dots$ les permutations relatives à l'énumération $1,2,3,\\dots,2n$ et $\\varphi,\\psi,\\chi,\\dots$ celles associées à $0,1,2,\\dots,2n-1$. On passe par exemple de la permutation $f$ à la permutation $\\varphi$ selon la relation $\\varphi(i)=f(i+1)-1$ pour tout $i\\in\\{0,1,2,\\dots,2n-1\\}$.\r\n\r\nIl est remarquable de constater que, bien au-delà de son aspect ludique, ce problème suscite des questions de nature algébrique avancées (théorie des groupes). L'étude approfondie de certaines permutations mises en jeu a été entreprise indépendamment de ce contexte par Lévy.\r\nCe problème connaît également des applications notamment en informatique (calcul parallèle, réseaux). Mentionnons enfin\r\nl'existence d'autres types de mélanges d'une importance notoire qui ont retenu l'attention des mathématiciens : les mélanges aléatoires.\r\n\r\n\\subsection{Plan de l'article}\r\n\\begin{itemize}\r\n\\li Dans la section II, nous présentons la modélisation du problème en introduisant toutes les permutations relatives aux différents mélanges de cartes. Certaines permutations redondantes ne seront pas nécessairement utiles, mais nous avons choisi de les écrire systématiquement afin de garder une homogénéité de notations ainsi qu'une logique de présentation. Selon les cas étudiés, certaines d'entre elles serviront à calculer la période du mélange en question, alors que d'autres permettront le calcul explicite des itérations successives.\r\n\\li Dans la section III, nous formulons de manière implicite les réponses relatives au calcul de périodes des mélanges étudiés.\r\n\\li Dans les sections IV et V, nous calculons explicitement, en faisant appel au calcul binaire, toutes les itérations successives de certaines permutations significatives, dans les cas particuliers où $n$ est une puissance de $2$ à $\\pm 1$ près, ce qui permet de fournir une réponse explicite aux questions posées.\r\n\\li Dans la section VI, nous examinons brièvement le cas d'un jeu contenant un nombre impair de cartes.\r\n\\li Dans la section VII, nous décrivons un procédé simple pour déplacer une carte donnée vers une position prédéfinie dans le cas où $n$ est une puissance de $2$.\r\n\\li Nous terminons dans la section VIII par une tentative de généralisation à un paquet de cartes divisible par un nombre supérieur à deux.\r\n\\end{itemize}" }]
