[{ "ID": "1", "Expression": "J'ai rencontré une charrette !", "Is_Story": "0", "Accepte": "0" }, { "ID": "2", "Expression": "Je suis le SDF de la maison.", "Is_Story": "0", "Accepte": "0" }, { "ID": "8", "Expression": "Titeuf, la plume au vent", "Is_Story": "0", "Accepte": "0" }, { "ID": "13", "Expression": "Vous ai-je déjà parlé de Toto ?", "Is_Story": "0", "Accepte": "1" }, { "ID": "12", "Expression": "Toto échange 13 billes contre 72 marshmallows.", "Is_Story": "0", "Accepte": "1" }, { "ID": "14", "Expression": "0+i0 = la tête à Toto... avec une larme sur l'oeil droit.", "Is_Story": "0", "Accepte": "1" }, { "ID": "15", "Expression": "Il ne faut pas oublier les puissances subliminales !", "Is_Story": "0", "Accepte": "1" }, { "ID": "16", "Expression": "On met tout ça dans un méga crochet...", "Is_Story": "0", "Accepte": "1" }, { "ID": "17", "Expression": "Un peu de magie vaudoue...", "Is_Story": "0", "Accepte": "1" }, { "ID": "19", "Expression": "Le collier de Diddlina<ENDtitre\r\n<br \/>\r\nVous ais-je déjà parlé de Toto ? Oui ? Bon alors aujourd'hui, nous allons parler de Diddle.<br \/>\r\nDiddle a une copine, je ne sais plus son prénom...ah si, Diddlina. Diddle est très amoureux de cette 'fille', mais diddle est bourrin. Alors il décide de lui offrir un collier.<br \/>\r\nMais Diddlina, elle, elle n'est pas sensible à l'art baroque, et elle lui répond en le regardant droit dans les yeux de son regard elliptique convergent  :<br \/>\r\nQu'il est :<br \/>\r\na)Un bélître (NDLR coquin)<br \/>\r\nb)Un béjaune (NDLR jeune homme sot et niais)<br \/>\r\nc)Un Philistin<br \/>\r\nd)Un béotien (NDLR esprit lourd, qui manque de gout)<br \/>\r\n<br \/>\r\nQue diriez-vous ? [tumulte et effervescence dans l'amphi].<br \/>\r\nMais non ! C'est tout simplement une brêle ! Car dans son élan lacrymonique, Diddlina aurait pu remarquer que la courbe que faisait son collier était une chainette...un sinus hyperbolique !", "Is_Story": "1", "Accepte": "0" }, { "ID": "20", "Expression": "Calculez donc cela avec votre machine de philistins... [Calcul de 8\/6 sur une calculatrice Casio-Sharp]", "Is_Story": "0", "Accepte": "1" }, { "ID": "21", "Expression": "Au feu les pompiers !", "Is_Story": "0", "Accepte": "0" }, { "ID": "22", "Expression": "On assemble ce qui se ressemble !", "Is_Story": "0", "Accepte": "0" }, { "ID": "23", "Expression": "Ce serait un truc de batard !", "Is_Story": "0", "Accepte": "0" }, { "ID": "25", "Expression": "Seriez-vous un Schtroumpf éponyme ? (cf. Histoires)", "Is_Story": "0", "Accepte": "1" }, { "ID": "27", "Expression": "Mickey dans les champs<ENDtitre\r\n<br \/>\r\nToto sentant naitre une pointe d'obsolescence insidieuse décide de prendre sa retraite. Il choisit donc comme parèdre...Mickey.<br \/>\r\nMickey, donc, va avec sa copine à la campagne. Sa copine, c'est...Clarabelle (c'est bien ainsi qu'elle s'appelle ? Amphi : Ouiii !). Il l'amène dans un champ pour regarder passer les trains, quel romantisme ! Malheureusement, le champ était rempli de stomoxes et de mélophages. Et Clarabelle a ces insectes en horreur ! Fort heureusement, Mickey s'agite de façon très pétulante : \"Ne t'inquiète pas, j'ai un anti-stomoxe. Mais pour me faire l'utiliser, tu dois répondre à cette question : quelle est la différence entre un train et mes oreilles ?\" Clarabelle réfléchit un peu, et répond : \"Aucune ! Ce sont tout les deux des cercles !\". A ces mots, Mickey s'énerve, et la traite :<br \/>\r\na) De péronnelle<br \/>\r\nb) De prégrièche<br \/>\r\nc) De pissandre<br \/>\r\nd) De Pôv Cloche<br \/>\r\nA vous de trouver...<br \/>\r\nLaissons là nos héros, et réfléchissons au sens de cette fable étiologique. Pourquoi une telle animadversion envers Clarabelle ? Car si elle avait vue au delà des apparences, elle aurait vue en Mickey des oreilles subliminales, qui ne sont point des cercles ! Ces oreilles forment en effet une épicycloïde avec points de rebroussements. (les \"tangentes\" entre chaque oreilles subliminales). Mais Clarabelle n'avait pas vraiment tort. Car si le train roule, ses roues forment une cycloïde. Et la tête de Mickey là dedans ? Prenez un cercle qui roule sur sa tête, un point sur ce cercle, et vous obtenez une épicycloïde. Comme quoi...<br \/>\r\nBon week end.", "Is_Story": "1", "Accepte": "0" }, { "ID": "28", "Expression": "Pour la composée, dans la théorie, c'est facile. Dans la pratique, c'est relou !", "Is_Story": "0", "Accepte": "1" }, { "ID": "30", "Expression": "Ne me remerciez pas, je suis payé pour ça !", "Is_Story": "0", "Accepte": "0" }, { "ID": "31", "Expression": "Toto au pays de l'infini<ENDtitre\r\n\\i{(illustration des ensembles équipotents)}\r\n\r\nToto est un chauffeur de car, mais il conduit un type de car un peu particulier : il transporte une infinité de totos... au pays de l'infini et les dépose devant un hôtel comportant une infinité de chambres... Il faut loger l'infinité de totos dans l'hôtel. Malheureusement, le pays de l'infini étant une destination très prisée, l'hôtel est archi-bondé, bref, il affiche \"complet\". Notre Toto automédon (i.e. le chauffeur de car) dit : \"nous pouvons loger tout le monde !\". Tous ? \"Oui\". Mais comment donc (et avec la condition d'une seule personne par chambre) ? Eh bien, numérotons les Totos : $0,1,2,3,\\ldots\\;$ ainsi que les chambres $0,1,2,3,\\ldots\\,$  On commence par évacuer les anciens occupants de l'hôtel c'était des Totobis : $0,1,2,3,\\ldots\\,$ Démarrons alors le processus d'affectation : on loge Toto 0 dans la chambre 0, Totobis 0 dans la chambre 1, Toto 1 dans la chambre 2, Totobis 1 dans la chambre 3, Toto 2 dans la chambre 4, Totobis 2 dans la chambre 5, ad lib.\r\nQu'avons-nous fait ? Nous avons construit une bijection de $2\\mathbb{N}$ vers $\\mathbb{N}$, ou encore, en renumérotant les Totobis $0,1,2,3,\\ldots\\,$ selon $-1,-2,-3,-4,\\ldots\\,$ une bijection de $\\mathbb{Z}$ vers $\\mathbb{N}$ : si $n\\,$ est positif ou nul (i.e. un Toto), on lui affecte la chambre paire $2n\\,$ et si $n\\,$ est négatif (i.e. un Totobis), on lui attribue la chambre impaire $2n+1\\,$. Moralité : dans $\\mathbb{Z}$ il y a autant d'éléments que dans $\\mathbb{N}$... (et pas deux fois plus, à moins que deux fois=une fois...)\r\n\r\nMais l'histoire ne s'arrête pas là : notre Toto automédon a d'autres potes automédons et ils rappliquent tous avec une infinité de cars contenant une infinité de Totos ! Comment loger tout le monde ?! Quitte à déloger tout l'hôtel dans un nouveau car, supposons que l'hôtel soit vide.  On numérote les cars $0,1,2,3,\\ldots$ et les Totos sont repérés par deux indices $(i,j)\\,$, $i\\,$ étant le numéro du car et $j\\,$ la place qu'il occupe dans ce car. On dispose tous ces couples dans un carré infini et on l'on procède à un balayage diagonal du carré et le numéro de position du Toto sur une diagonale donnera le numéro de la chambre à laquelle il aura droit.\r\nOn construit ainsi une bijection de $\\mathbb{N}\\times\\mathbb{N}$ sur $\\mathbb{N}$ : $(i,j)\\mapsto i+(i+j)(i+j+1)\/2$...\r\n\r\n~\r\n\\b{Bonus track} : une autre bijection $(i,j)\\mapsto (2i+1)2^j$...\r\n\r\nAh oui, j'allais oublier de dire : en fait, Toto, son vrai nom c'est Hilbert...", "Is_Story": "1", "Accepte": "1" }, { "ID": "32", "Expression": "Toto sur les bancs de l'école communale<ENDtitre\r\n\\i{(illustration de la division euclidienne)}\r\n\r\nToto, notre cancre bucolique du dernier rang est en train de se livrer à quelques tractations regrettables : il troque 13 tablettes de chocolat contre 275 billes. D'où le problème cornélien : combien de billes pour une tablette ? Ça sent un peu l'arnaque...\r\nAllez, petite anamnèse collective : 275 divisé par 13, il y va deux fois, deux fois 13 égalent 26, ôtés de 27 égalent 1, etc., bref, on arrive, sous forme linéaire, à $275=13\\times 21+2$. Mais 275 c'est quoi ? 5, c'est le chiffre des unités, 7, celui des dizaines, 2, celui des centaines, i.e. $275=2\\times 10^2+7\\times 10+5$. Maintenant, 10, appelons-le $X\\,$ et recommençons à zéro : on divise $2X^2+7X+5\\,$ par $X+3\\,$, ce qui donne : quotient=$2X + 1$, reste=$2\\,$, quoi de plus trivial ?\r\nPour ceux qui n'ont pas tout suivi, vous pouvez remplacer les tablettes par des shamallows...", "Is_Story": "1", "Accepte": "1" }, { "ID": "73", "Expression": "Elmer au pays des lagomorphes<ENDtitre\r\n\\i{(illustrations des suites de Fibonacci)}\r\n\r\nElmer spécialiste de cynégétique (Elmer le chasseur) à une vieille dette envers Bugs Bunny qu'il n'arrive jamais à attraper... Mais il s'est promis la décimation de la descendance du lapinos. Chez Bunny, la règle de reproduction est légèrement curieuse : Bunny a deux descendances qui s'étalent sur deux générations consécutives...\r\n(Amphi : interviennent M. Millon et M. Colliva : \"M'sieur ! enfin, ce sont des lapins !\". Le prof. : \"Et alors, ce sont des lapins de Fibonacci, 1202 !\")\r\nL'histoire ne parle pas des femelles, ne vous en offusquez point mesdemoiselles, ce n'est pas du machisme, ce n'est seulement que de la scissiparité... On trouve sur une même ligne de génération des tontons et des neveux. (Amphi : remarque de M. Tain : \"ça sent l'inceste !\". Le prof. :  \"Nooon, il n'y a pas d'autocroisement, pas d'inceste !!!\")\r\nSe pose alors le problème cornélien pour notre Elmer : combien de cartouches (en supposant qu'il fasse mouche à tous les coups) lui faudra-t-il utiliser pour arriver à la décimation de la $n$-ième descendance ?\r\nMathématiques : notons $u_n\\,$ le nombre de descendants de la $n\\,$-ième génération. Chaque lapin descend d'un lapin de la génération antérieure ou de celle d'avant, d'où la récurrence $u_n=u_{n-1}+u_{n-2}\\,$ avec $u_0=u_1=1\\,$.\r\nSolution : $u_n=\\frac{1}{\\sqrt5}\\left[\\left(\\frac{1+\\sqrt5}{2}\\right)^{n+1}-\\left(\\frac{1-\\sqrt5}{2}\\right)^{n+1}\\right]$. \r\n~\r\n\\b{Bonus track} : paraît que c'est un entier...", "Is_Story": "1", "Accepte": "1" }, { "ID": "37", "Expression": "On a été capturé insidieusement et fallacieusement par un paparazzi ! [À quelqu'un qui a sorti son appareil photo]", "Is_Story": "0", "Accepte": "1" }, { "ID": "34", "Expression": "Ce serait un truc bâtard !", "Is_Story": "0", "Accepte": "0" }, { "ID": "35", "Expression": "On assemble ce qui se ressemble ! (Non-dit par le prof : c'est une paronomase...)", "Is_Story": "0", "Accepte": "1" }, { "ID": "38", "Expression": "C'est bon, tout le monde a digéré son Vomito ? (cf. <a href=\"46-Titeuf,%20le%20retour%20!\">l'histoire correspondante<\/a>)", "Is_Story": "0", "Accepte": "1" }, { "ID": "39", "Expression": "Parce que la bornitude, elle on peut l'étendre sur C (<em>NDW : c'est Royal, comme phrase... :-)<\/em>) [En parlant des suites numériques]", "Is_Story": "0", "Accepte": "1" }, { "ID": "40", "Expression": "Attention, flèche capricante ! (resp. palinodique)", "Is_Story": "0", "Accepte": "1" }, { "ID": "41", "Expression": "Arrêtez-le ! [auto-critique du prof. se livrant à une division suivant les puissances croissantes sans en avoir fixé l'ordre au préalable]", "Is_Story": "0", "Accepte": "1" }, { "ID": "42", "Expression": "Merci, mais nous nous connaissons depuis assez longtemps pour que vous sachiez qu'il y a trois choses différentes : ce que je dis, ce que je pense, et ce que j'écris. Et cela fait trois mondes concomitants. Sans parler de ce que je ne dis pas, de ce que je n'écris pas, et de ce que je ne pense pas... [À quelque dissident qui aurait remarqué une faute dans le texte du prof.]\r\n", "Is_Story": "0", "Accepte": "1" }, { "ID": "43", "Expression": "Merci de votre assentiment, M. Millon, et de votre satisfecit !", "Is_Story": "0", "Accepte": "1" }, { "ID": "44", "Expression": "Diantre, ventre-saint-gris !", "Is_Story": "0", "Accepte": "1" }, { "ID": "45", "Expression": "Allez, une petite anamnèse de l'école communale...", "Is_Story": "0", "Accepte": "1" }, { "ID": "46", "Expression": "Toto et le tonton d'Amérique<ENDtitre\r\n\\i{(illustration des fractions rationnelles)}\r\n\r\nToto a un tonton d'Amérique richissime qui vient d'aller ad patres, laissant un héritage colossal. Toto se découvre tout d'un coup un autre héritier (putatif ?) totalement méconnu qui vient réclamer sa part.\r\nMais Tonton (pas Toto) avait tout prévu car il avait pris soin de rédiger dans son testament un codicille suspensif stipulant in extenso que tout héritier surnuméraire, disons Toto 2nd, qui oserait prétendre à quelque part que ce soit devrait résoudre une énigme posée par Toto (disons Toto 1er) s'il veut acquérir sa part et éviter la déshérence.\r\nToto 1er qui entend bien s'arroger subrepticement une part léonine, et pour qui une forfaiture ou félonie n'est jamais de trop, fit mine d'accepter, magnanime, la règle du jeu et pose à Toto 2nd le problème suivant :\r\n\\quote{Je te reverserai ta part de $N$ € si tu me dis de combien de façons je peux le faire avec le stock (supposé infini) de pièces de 1€ et de 2€ que Tonton nous laisse.}\r\nLa bonne réponse est $\\frac{N+1}{2}+\\frac{1+(-1)^N}{4}$ qui vaut $\\frac{N+2}{2}$ lorsque $N$ est pair et$\\frac{N+1}{2}$ lorsque $N$ est impair (décomposition en éléments simples de la fraction rationnelle $\\frac{1}{(1-X)(1-X^2)}$)...\r\n~\r\n\\b{Bonus track} : reprendre le problème lorsque Tonton laisse un pactole de pièces de 1, 2 et 3 € (décomposer $\\frac{1}{(1-X)(1-X^2)(1-X^3)}$, bon courage !).", "Is_Story": "1", "Accepte": "1" }, { "ID": "47", "Expression": "Oui, oui, c'est désopilant, ça c'est sûr !", "Is_Story": "0", "Accepte": "1" }, { "ID": "48", "Expression": "Il y a des jours où je me sens las...", "Is_Story": "0", "Accepte": "1" }, { "ID": "49", "Expression": "Ce matin déjà, dans le groupe 11, quelle ne fut pas ma consternation de découvrir qu'ils ne savaient pas dériver !", "Is_Story": "0", "Accepte": "1" }, { "ID": "50", "Expression": "Vous n'avez pas pris la bonne fonction, tonnerre de Brest !", "Is_Story": "0", "Accepte": "1" }, { "ID": "51", "Expression": "Nul n'est prophète en son pays...", "Is_Story": "0", "Accepte": "1" }, { "ID": "52", "Expression": "Toto de la cambrousse<ENDtitre\r\n\\i{(illustration de la règle de trois)}\r\n\r\nToto de la Cambrousse vient faire des études à la ville (notre Toto aujourd'hui est intello). La ville est loin de chez lui, il faut prendre le train tôt le matin : le train part à 6 h 42 de la gare pour arriver à 7 h 36 à la grand-ville (Lyon Perrache c'était la gare centrale, vous n'avez peut-être pas connu...) puis il fallait emprunter le métro qui mettait 24 min. avant d'arriver enfin à 8 h précises à destination : \"Faculté des Sciences des Structures et des Matières\" (traduction du jargon pompeux : mathématiques, physique, chimie, mécanique...) Mais, le train du lundi matin n'était jamais à l'heure (ça c'est une périssologie !), et prenait habitude d'arriver à 7 h 47. Toto arrivait ainsi à 8 h 11 et se retrouvait devant l'amphi porte close avec un Cerbère devant. C'était le cours de chimie du professeur J. dont nous tairons pudiquement le nom...\r\nRéadaptons cette anecdote en des termes modernes. Toto qui loge dans la résidence A d'un certain campus doit se rendre à l'amphi Vannier d'une certaine institution pour assister au cours de mathématiques d'un certain professeur L. démarrant à 8 h précises. Sachant que l'amphi Vannier se situe à une distance de 100 m. de la résidence A et que notre Toto moderne se meut à la vitesse de 6 km\/h=1 km\/10 min=100 m\/min, pour arriver à l'amphi à l'heure incriminée, il lui faut précisément un déplacement d'1 minute et donc partir à 7 h 59...\r\nJe pense que le message est clair, mon cours commence à 8 h et non 8 h 05... À bon entendeur, salut !", "Is_Story": "1", "Accepte": "1" }, { "ID": "53", "Expression": "Le collier de Diddlina<ENDtitre\r\n\\i{(illustration des fonctions hyperboliques)}\r\n\r\nVous ai-je déjà parlé de Toto ? Oui ? Bon alors aujourd'hui, nous allons parler de Diddle.\r\nDiddle a une copine, je ne me souviens plus son prénom... ah si, Diddlina. Diddle est très épris de cette 'fille', mais Diddle est un peu rimbou, il ne sait pas comment lui avouer ses sentiments.\r\nAlors il décide de lui offrir un collier qu'il lui accroche autour du cou et s'exclame : \"quelle magnifique parabole !\".\r\nMais Diddlina, qui n'est pas vraiment sensible à l'art baroque, lui répond en le regardant droit dans les yeux de son regard elliptique convergent : \"parabole, parabole, est-ce que j'ai une tête de parabole ?!\"\r\nElle lui hurle qu'il est :\r\n\r\n\\item réponse a : un bélître\\footnote{NDLR :coquin} !\r\n\\item réponse b : un béjaune \\footnote{NDLR : jeune homme sot et niais} !\r\n\\item réponse c : un philistin !\r\n\\item réponse d : un béotien\\footnote{NDLR : esprit lourd, qui manque de goût} !\r\n\r\nQuelle est la bonne réponse ? [tumulte et effervescence dans l'amphi]. Aucune ! C'est tout simplement une brêêêle ! Car dans son élan acrimonieux, Diddlina, ainsi que Diddle auraient dû remarquer que la courbe que faisait le collier était une chaînette... un cosinus hyperbolique !!!", "Is_Story": "1", "Accepte": "1" }, { "ID": "54", "Expression": "Titeuf et sa voiture<ENDtitre\r\n\\i{(illustration du théorème des accroissements finis)}\r\n\r\nVous ai-je déjà parlé de Toto ? Oui ? Vous en avez peut-être ras-le-bol ? Amphi : Nooon !\r\nTiteuf vient de réussir son permis de conduire... au bout de la cinquième fois.\r\n\r\nIl a une copine qui s'appelle Nadia, jeune odalisque au sourire lilial et séraphique et à la dentition adamantine, coruscante, voire éburnéenne, dont il est secrètement épris.\r\nTiteuf qui n'a pas la plume particulièrement littéraire, et donc peu enclin à rédiger des épigrammes élégiaques ou anacréontiques, voire ossianiques, lui propose plutôt, rimbou et avec un ton relou : \"Eh Nadia, tu viens faire un tour dans ma décapotable rouge... couleur Ferrari ?!\" Il lui propose de partir d'Ici et d'aller à Donf distante d'Ici de 3000 km et ce, en 3 heures ! A ces propos, Nadia est prise d'une crise d'érythrophobie, Titeuf se ravise et propose plutôt 300 km en 3 heures, soyons raisonnable : vitesse moyenne 100 km\/h.\r\nTraçons la loi horaire de ce parcours : au temps t=0, la voiture est dans le garage, donc vitesse nulle, puis la vitesse croît, il y a quelques paliers horizontaux : traversée du péage, pause-pipi, petit marivaudage intempestif, etc. puis arrivée à Donf chez leur copain Vomito avec une vitesse nulle afin de ne pas rouler sur les pieds de Vomito, sinon il vous vomira dessus...\r\nMoralité de l'histoire : le théorème des accroissements finis stipule qu'à un moment la vitesse instantanée égalait la vitesse moyenne...", "Is_Story": "1", "Accepte": "1" }, { "ID": "55", "Expression": "Mickey à la campagne<ENDtitre\r\n\\i{(illustration de la formule de Taylor-Young)}\r\n\r\nToto sentant naître une pointe d'obsolescence insidieuse décide de prendre sa retraite. Il choisit donc comme parèdre... Mickey.\r\nMickey, notre sigisbée patelin, papelard, voire cauteleux, donc, invite une copine à la campagne. Cette copine, c'est... Clarabelle, le bovidé mafflu (c'est bien ainsi qu'elle s'appelle ? Amphi : Ouiii !).\r\nIl l'amène dans un champ... Mais pour quoi faire ? Pour regarder passer les trains pardi !!! Quel romantisme bucolique !\r\nMais il y avait un piège : le champ était bourré de stomoxes et de mélophages. Et Clarabelle a ces insectes en horreur ! Fort heureusement, Mickey (qui détient plus d'un aérosol dans sa gibecière) se montre rassérénant :\r\n\"Ne t'inquiète pas, j'ai amené mon anti-stomoxes. Mais pour me le faire utiliser, tu dois répondre à cette question : quelle est la différence entre les roues du train qui passe et mes oreilles ?\"\r\nClarabelle réfléchit un instant, et répond : \"Aucune ! Elles sont toutes les deux circulaires !\".\r\nÀ ces mots, Mickey prit un ton comminatoire et lui adresse quelques privautés : il la traite \"espèce de\"\r\n\r\n\\item réponse a : péronnelle !\r\n\\item réponse b : pie grièche !\r\n\\item réponse c : poissarde !\r\n\\item réponse d : pôv' cloche !\r\n\r\nQuelle est la bonne réponse ? À vous de trouver...\r\nLaissons là nos héros, et réfléchissons au sens de cette fable étiologique. Pourquoi une telle animadversion envers Clarabelle ?\r\nCar si elle avait vu au-delà des apparences, elle aurait vu sur Mickey des oreilles subliminales, qui ne sont point des cercles !\r\nCes oreilles forment en effet une épicycloïde avec points de rebroussements (les \"tangentes\" entre chaque oreilles subliminales) : équations paramétriques : $x(t)=R[(N+1)cos(t)-cos((N+1)t)],\\; y(t)=R[(N+1)sin(t)-sin((N+1)t)]$. Puis formule de Taylor-Young pour voir ce qu'il se passe au \"pied\" de l'oreille de Mickey...\r\nMais Clarabelle n'avait pas complètement tort. Car lorsque le train roule, un point fixe au bord de ses roues décrit une cycloïde, d'équations paramétriques $x(t)=R[t-sin(t)],\\; y(t)=R[1-cos(t)]$.\r\n\r\nEt la tête de Mickey là-dedans ? Prenez un cercle qui roule sur sa tête, un point sur ce cercle, et vous obtenez une épicycloïde. Comme quoi...\r\nBon week-end.", "Is_Story": "1", "Accepte": "1" }, { "ID": "60", "Expression": "Titeuf à Donf<ENDtitre\r\n\\i{(illustration des développements limités)}\r\n\r\nSuite et fin (Amphi : Oooh !).\r\nDonc Titeuf... Mais que s'est-il déjà passé la dernière fois ? Il allait à Donf, je crois... ah oui c'est ça, y en a qui retiennent !\r\nDonc Titeuf et sa pote Nadia sont partis à Donf rejoindre leur pote Vomito. Mais le détail que nous avions omis, c'est qu'à Donf, c'est le no man's land.\r\nEt donc Titeuf redoute les échauffourées pour sa belle voiture, sa belle auto rouge Ferrari. Mais Vomito, qui est toujours en proie à quelques problèmes de cacostomie, n'est-ce pas, c.-à-d. qu'il faut instaurer un périmètre de sécurité avec lui dedans, a une solution pour éviter à la belle auto de son pote Titeuf un gigantesque autodafé par les pyromanes du secteur. Du coup, qu'est-ce qu'il propose...\r\nAh oui, âmes et coeurs sensibles s'abstenir... ou bouchez vos oreilles chastes... Vomito propose de lâcher un petit... enfin, bref, de crépir sa belle voiture : \"Je te garantis que personne ne touchera ta voiture et peux t'assurer qu'elle passera au moins un nycthémère chez nous !\". A ces mots, la plume de Titeuf commence à chavirer, Nadia entre dans une pâmoison absolument transcendantale, et Vomito, face à cette réaction, se dit : \"Bon, il faut que je vienne à résipiscence en proposant une autre solution\".\r\nAh, ça y est, j'y suis (tonnerre, j'ai un de ces tracs !)\r\n\"Bon, voilà donc ma solution, mais tu dois résoudre mon énigme : si tu m'indique la longueur minimale dont tu as besoin pour rentrer ta voiture, et ce sans l'érafler, alors je te trouve un petit garage pour la protéger des malotrus.\" Mettons donc cela en équation. [Tracé au tableau] Voilà la voiture, c'est une Smart [amphi : \"Nooon, c'était une Ferrari !!!\"], oui, c'est bien ce que je disais : couleur Ferrari... et n'oublions pas : permis au bout de 5 fois, il ne faut pas confier n'importe quoi à Titeuf. [S'ensuit une longue mise en équation du mouvement de la porte de garage : épicycloïde à 4 points de rebroussement, alias astroïde, puis illustration des développements limités...]", "Is_Story": "1", "Accepte": "1" }, { "ID": "61", "Expression": "Schtroumpf à la mer<ENDtitre\r\n\\i{(illustration des séries de Riemann et géométriques)}\r\n\r\nEn cette période de fin d'année, l'heure est propice aux bilans :\r\n\r\n\\item Toto devenu cacochyme et suranné a pris une retraite bien méritée ;\r\n\\item Diddle s'est pris une bonne raclée verbale par Diddlina affublée de ses colifichets et autres affiquets en sustentation autour de son cou (souvenez-vous : la chaînette, bref le cosinus hyperbolique, magnifique !) ;\r\n\\item Titeuf, après ses tribulations à Donf a décidé de retirer ses billes et sa plume du jeu ;\r\n\\item Mickey notre sigisbée patelin international voire œcuménique, ayant bien joué avec les stomoxes, mélophages et autres hippobosques, considère qu'après une telle gloire il préfère se retirer sous les vivats et satisfecits d'une foule en liesse.   \r\n\r\nTous ces protagonistes ubuesques ne seraient-ils pas les cassandres d'une descente insidieuse vers la géhenne apocalyptique ?\r\nHeureusement, le petit homme bleu est là : j'ai nommé Schtroumpf paresseux alias Schtroumpfy.\r\nSchtroumpfy rêve de soleil et de mer \\footnote{NDLR : rappelons que nous sommes à la veille de Noël...}. À la plage, des schtroumpfettes se schtroumpfent avec schtroumpferie (traduction de l'auteur : des odalisques se pavanent avec ostentation). Schtroumpfy en son for intérieur se dit : \"bah ! schtroumpfez, schtroumpfez, votre pétulance n'est pas immarcescible, mais carpeee...diem !\"\r\nNotre apprenti godelureau, dans son délire onirique, prend idée de jouer : il se met à creuser un trou dans le sable énooo...rme d'un volume de... 2 litres !\r\nLe voici en train de sortir de son escarcelle trois verres gradués (empruntés à sa mémée de Bagnères-de-Bigorre, mêêê...euuu...h) pour aller puiser de l'eau dans la mer.\r\n\r\n\\item Le premier verre comporte les graduations $1, \\frac{1}{2}, \\frac{1}{3}, \\frac{1}{4}, \\frac{1}{5}, \\frac{1}{6},\\ldots$\r\n\\item Le deuxième les graduations $1, \\frac{1}{4}, \\frac{1}{9}, \\frac{1}{16}, \\frac{1}{25}, \\ldots$\r\n\\item Le troisième les graduations $1, \\frac{1}{2}, \\frac{1}{4}, \\frac{1}{8}, \\frac{1}{16},\\ldots$\r\n\r\nIl pose alors la devinette suivante aux schtroumpfettes schtroumpfeuses qui n'avaient cessé de schtroumpfer (traduction de l'auteur : aux almées lascives qui n'avaient cessé de se trémousser) : \"Avec le(s)quel(s) de ces verres pourrai-je remplir mon trou ?\"\r\n\r\nRéponse :\r\n\\begin{tabular}\r\nPremier verre & $1+\\frac{1}{2}+\\frac{1}{3}+\\frac{1}{4}+\\frac{1}{5}+\\frac{1}{6}+\\cdots=\\sum_{n=1}^{+\\infty} \\frac{1}{n}=+\\infty$ \\\\\r\nDeuxième verre & $1+\\frac{1}{4}+\\frac{1}{9}+\\frac{1}{16}+\\frac{1}{25}+\\cdots=\\sum_{n=1}^{+\\infty} \\frac{1}{n^2}<2$ \\\\\r\nTroisième verre & $1+\\frac{1}{2}+\\frac{1}{4}+\\frac{1}{8}+\\frac{1}{16}+\\cdots=\\sum_{n=1}^{+\\infty} \\frac{1}{2^n}=2$\r\n\\end{tabular}\r\n\r\nEn rajoutant l'hypothèse que Schtroumpfy est immortel et, pour les détracteurs et autres zoïles de mauvaise foi, en supposant que notre sable n'est pas poreux, il vient qu'avec son premier verre, non seulement il remplira son trou (inutile de vivre très longtemps : $1+\\frac{1}{2}+\\frac{1}{3}+\\frac{1}{4}>2$), mais le plus hilarant est qu'il va vider la mer (là, il y passera un certain temps...)\r\nAvec son deuxième verre, on a $1+\\frac{1}{4}+\\frac{1}{9}+\\frac{1}{16}+\\frac{1}{25}+\\cdots<2$ et le trou ne sera pas rempli.\r\n~\r\n\\b{Bonus track} (pour les initiés) : $1+\\frac{1}{4}+\\frac{1}{9}+\\frac{1}{16}+\\frac{1}{25}+\\cdots=\\frac{\\pi^2}{6}$...\r\nAvec son troisième verre, on a $1+\\frac{1}{2}+\\frac{1}{4}+\\frac{1}{8}+\\frac{1}{16}+\\cdots+\\frac{1}{2^n}<2$ et donc, tout immortel qu'il puisse être, le trou ne pourra jamais être comblé, à moins de rajouter à notre échelle de temps infinie un temps ultime infini...\r\nÀ cet instant précisément $1+\\frac{1}{2}+\\frac{1}{4}+\\frac{1}{8}+\\frac{1}{16}+\\cdots=2$ et le trou est rempli pile poil !\r\n\r\nAlors Schtroumpfettes : heureuses ?\r\n\r\nQuestion insidieuse de la part d'un Schtroumpf de l'assistance : \"Et si le sable absorbe l'eau ?\"\r\nRéponse du narrateur : \"Il faut avouer que la mémée de Bagnères-de-Bigorre n'était pas une fine patissière et qu'elle n'utilise pas Francine, en conséquence il y a des grumeaux dans le sable ce qui évite toute porosité... Pour les non convaincus, disons que GCU est venu couler une paroi en béton dans le trou de sable. D'autres remarques ?\"", "Is_Story": "1", "Accepte": "1" }, { "ID": "62", "Expression": "Picsou le banquier<ENDtitre\r\n\\i{(illustration des suites arithmético-géométriques)}\r\n\r\nIl fut un temps où, pendant les fêtes de Noël, on diffusait à profusion sur les écrans de télévision des Mickeys. De nos jours face à la pénurie de Micheys, je me dois d'y remédier. Mais rappelons que Mickey a pris sa retraite.\r\nHeureusement, il nous laisse ses potes les anatidés : Donald et Picsou.\r\nRappelons que Picsou est l'illustre ploutocrate plénipotentiaire de la mégalopole Picsouville, expert en numismatique, orfèvre des valeurs fiduciaires.\r\nPicsou a un neveu sans le sou : Donald. Notre pauvre hère, au bord de la ruine, n'a pas d'autre choix que de faire un emprunt auprès de son banquier préféré Tonton Picsou.\r\nPicsou accepte très (trop ?) volontiers de faire crédit, mais ayant toujours cette propension compulsive et inc\\oercible à quelque malversation, prévarication et autre concussion, la prudence est de mise.\r\nAidons notre pauvre Donald à ne pas se faire rouler dans la farine. Passons donc aux mathématiques :\r\nDonald emprunte la somme $S_0$ au taux mensuel $r$ ($r=\\frac{a}{1200}$ si le taux annuel est $a$ %) pour une durée de $N$ mois. Calculons la mensualité à rembourser.\r\nEn notant $S_n$ la somme restant à rembourser au bout du $n\\,$-ième mois, on a la récurrence $S_n=(1+r)S_{n-1}-m$. Solution : $S_n=(1+r)^nS_0-[(1+r)^n-1]\\frac{m}{r}$.\r\nA l'échéance, Donald aura tout remboursé : $S_N=0$, ce qui donne la mensualité : $m=\\frac{rS_0}{1-1\/(1+r)^N}$.\r\n~\r\n\\b{Bonus track} : quid de l'assurance et autres frais annexes, puis du TEG ?", "Is_Story": "1", "Accepte": "1" }, { "ID": "74", "Expression": "Le fumeur impénitent<ENDtitre\r\n\\i{(illustration de la loi géométrique)}\r\n\r\nUn fumeur en état d'assuétude exacerbée cherche à allumer une cigarette. Dans un élan irrépressible, à l'instant même où il enfile frénétiquement une main capricante dans sa gibecière à la recherche désespérée de quelque allumette, se déchaînent les éléments : bref, l'apocalypse est imminente et sera immanente ! Mais notre fumeur est bien décidé à ne pas apostasier...\r\nIl dispose d'une boîte de $n$ allumettes et chaque allumette a une probabililité $p$ d'allumer la cigarette.\r\n\r\nNous sommes alors confronté aux problèmes cornéliens suivants :\r\n\\begin{enumerate}\r\n\\li Quelle est la probabilité que le fumeur arrive à allumer sa cigarette ?\r\n\\li Quelle est la loi de probabilité du numéro d'apparition de la première allumette qui arrive à allumer la cigarette ?\r\n\\li Quelle est la loi de probabilité du nombre d'allumettes utilisées ?\r\n\\end{enumerate}\r\n\r\nRéponses :\r\n\\begin{enumerate}\r\n\\li La probabilité qu'aucune des $n$ allumettes n'allume la cigarette est $(1-p)^n$, et alors celle d'allumer la cigarette est $1-(1-p)^n$.\r\n\\li Soit $X$ le numéro d'apparition de la bonne allumette \"deus ex machina\". La variable aléatoire $X$ a pour valeurs possibles $1,2,\\ldots,n$ et éventuellement une valeur fictive, disons 0, dans le cas où aucune allumette n'allumerait la cigarette. La loi de $X$ est donnée par $P(X=k)=(1-p)^{k-1}p$ pour $1\\le k\\le n$ et $P(X=0)=(1-p)^n$.\r\n\\li Soit $Y$ le nombre d'allumettes utilisées. La variable aléatoire $Y$ a pour valeurs possibles $1,2,\\ldots,n$. La loi de $Y$ est donnée par $P(Y=k)=(1-p)^{k-1}p$ pour $1\\le k\\le (n-1)$ et, dans le cas où toutes les allumettes sont utilisées (les $(n-1)$ premières n'allument pas la cigarette et la dernière allume ou non la cigarette), $P(X=n)=(1-p)^{n-1}$.\r\n\\end{enumerate}\r\n~\r\n\\b{Bonus track} : quid d'un nombre infini d'allumettes (loi géométrique) ?", "Is_Story": "1", "Accepte": "1" }, { "ID": "75", "Expression": "Snif ! snif ! ça sent une petite odeur, vous ne sentez pas ? Mais \r\nqu'est-ce que ça sent ?... Ah oui, ça y est, j'y suis, ça sent \r\nl'arnaque !!! [En tournant autour d'un élève écrivant une formule \r\nsibylline au tableau]", "Is_Story": "0", "Accepte": "1" }, { "ID": "76", "Expression": "Toto l'aspirant à la ploutocratie<ENDtitre\r\n\\i{(Version remix 2008 de Toto et le tonton d'Amérique, toujours illustration  des fractions rationnelles)}\r\n\r\nToto a un tonton d'Armorique qui vient d'être emporté par un psychopompe pour rejoindre le monde des défunts. Faut dire que le brave homme accusait un âge canonique et affichait une santé devenue irrémissiblement cacochyme ! Cela dit, sous des aspects de vénérable, vénéré et vertueux retraité qui n'étaient qu'une couverture, Tonton se livrait à quelques incartades non philanthropiques : il était un broker on-line, bref, il boursicotait en catimini le filou !\r\nOn s'en doute bien, il laisse derrière lui une fortune colossale, un vrai cador Tonton ! Comme d'habitude, dans ce genre de vaudeville de midinette (tendance inepte), truffé de rebondissements de dernière minute, surgit ex nihilo un cousin apocryphe au tonton putatif... Mais Tonton, qui n'était pas né de la dernière pluie, avait pris soin de rédiger, en bon testateur qui se respecte, le fameux codicille suspensif qui édictait ad litteram une petite énigme pour départager les totos candidats à la ploutocratie :\r\n\" disposant d'un tas infini de pièces de 1 et 2 euros (n'oublions pas que Tonton avait une fortune colossale, une véritable corne d'abondance !), de combien de façons peut-on former la somme de $n$ euros avec de telles pièces ? \" La réponse juste après la pub ! Vite une petite fraction rationnelle !!!", "Is_Story": "1", "Accepte": "1" }, { "ID": "77", "Expression": "Toto entre l'oblativité et le népotisme<ENDtitre\r\n\r\n\\i{(Illustration des suites arithmético-géométriques)}\r\n\\i{(suite de \"Toto l'aspirant à la ploutocratie\")}\r\n\r\nToto ayant résolu la petite énigme édictée dans le testament du Tonton d'Armorique parti ad patres vient d'accéder à la ploutocratie : il est devenu richissime. Aujourd'hui, nous avons affaire à un grand expert de numismatique et brasse les valeurs fiduciaires à tour de bras. À son tour de jouer le tonton \"pawnbroker\\footnote{Pawnbroker est le terme anglais désignant un prêteur sur gages}\" (dur l'atavisme !).\r\n\r\nIl a un neveu Toto junior, alias Titi, qui n'est pas un cadeau ! Titi est un pauvre hère particulièrement dispendieux (un véritable panier percé et endetté jusqu'au cou, ah le boulet !!!) qui attend désespérément un geste de mansuétude et de munificence de la part de son tonton Toto. Notre Toto qui n'a jamais été enclin à l'oblativité (traduction du narrateur : qui pense à lui avant les autres) ne saurait rester nonobstant insensible face aux lamentos et mélopées plus ou moins psalmodiques de son Titi non adulé... Faut dire que le Tonton d'Armorique avait laissé quelques engrammes subliminaires dans les esprits et avait pris soin d'enseigner à notre Toto les règles du népotisme familial (traduction du narrateur : on sert les copains d'abord) - un vrai parrain feu Tonton...\r\n\r\nToto décide donc après réflexion d'allouer un crédit à son Titi avec la condition sine qua non d'en faire bon usage et de trouver le moyen de s'enrichir avec la somme prêtée. Aidons notre humble Titi à accomplir cette mission (la quête du Graal...).\r\n\r\nToto prête à Titi la somme $S_0$ au taux mensuel $r$ ($r=\\frac{a}{1200}$ si le taux annuel est $a \\%$) pour une durée de $N$ mois. Calculons la mensualité à rembourser.\r\n\r\nEn notant $S_n$ la somme restant à rembourser au bout du $n$-ième mois, on a la récurrence $S_n=(1+r)S_{n-1}-m$. Solution : $S_n=(1+r)^nS_0-[(1+r)^n-1]m\/r$. A l'échéance, Titi aura tout remboursé : $S_N=0$, ce qui donne la mensualité : $m=r\\frac{S_0}{1-1\/(1+r)^N}$.\r\n\r\nMaintenant supposons Titi plus malin qu'il n'en a l'air : plutôt que de rembourser ses dettes, il place la somme empruntée à Toto à la caisse d'épargne au taux mensuel $s$ ($s=\\frac{b}{1200}$ si le taux annuel est $b \\%$). Habituellement les intérêts se calculent chaque quinzaine, mais nous ferons simple... Cela lui rapporte à l'échéance la somme $S_0\\,[(1+s)^N-1]$. Titi aura fait jeu gagnant si les taux $r$ et $s$ vérifient l'inégalité $S_0\\,[(1+s)^N-1]>Nm-S_0$.\r\n\r\nExemple numérique : $a=5 \\%$ (taux annuel du crédit) et $b=2,7 \\%$ (taux annuel minimum du bon placement à trouver) sur $N=1$ an donnent un jeu gagnant.\r\n\r\nQuestion irrévérencieuse posée par un membre de l'assemblée : \"mais si Titi place l'argent emprunté, comment fera-t-il pour le rembourser ?\"\r\nRéponse du narrateur : \"il y avait naturellement une petite arnaque ! Disons que Titi disposait d'autres fonds...\"\r\n\r\nAjout supplétif après la représentation : Titi ne pouvant plus assurer son autarcie a dû se dégoter un CDD dont les revenus mensuels lui permirent de rembourser son crédit...", "Is_Story": "1", "Accepte": "1" }, { "ID": "78", "Expression": "Toto l'apprenti sigisbée<ENDtitre\r\n\\i{(Illustration des fonctions hyperboliques, version remix 2009 du collier de Diddlina)}\r\n\r\nToto, cancre occupant indéfectiblement le dernier rang de l'école communale, se prend aujourd'hui pour un sigisbée et se met en quête de taquiner une copine avoisinante : Titine... Mais quelle ruse adopter pour suborner la soubrette ? Car, tant au niveau tè-ke-nik qu'au niveau ta-ke-tik, notre Toto godelureau n'est pas un cador de la littérature : l'art ossianique, les versets élégiaques, les sonnets rimbaldiens, ce n'est pas pour lui. Toto, c'est plutôt tendance relou-rimbou, pas Rimbaud ! Dans un élan de lucidité ineffable surgit une idée dans la petite tête de Toto\\footnote{\\i{NDLR : notez les allitérations.}} : Toto va offrir un joli collier à Titine. \"Tiens Titine vénérée et adulée, voici un modeste présent sans arrière-pensée aucune\". Titine, dans son for intérieur, se dit : \"Tiens, Toto est un thuriféraire aujourd'hui, ça sent l'embrouille...\" [\\i{Pensée du prof. : D'ailleurs, fait insolite aujourd'hui, un adonis habillé en pseudo-gladiateur (torse nu, n'ayant qu'un short pour seul vêtement) s'était installé sur les derniers bancs de l'amphi. Assurément, ce n'était pas un autochtone de la lanière D. Était-ce un espion ou un inspecteur de quelque aréopage de zoïles c\\oercitifs ? Soyons sur nos gardes... \"Qu'est-ce qu'il peut faire chaud dans cet amphi ! Gare aux bouffées de chaleur !\"}] Toto, avec une délicatesse compassée, accroche le colifichet au cou de la jeune midinette qui arborait ses avantages avec une certaine ostentation. À cette vue, dans une pétulance compulsive, Toto s'exclame : \"Diantre, quelle magnifique parabole que je vois là !!!\" À ces mots, Titine, non moins relou-rimbou que Toto Godeluro, entra dans une ire exacerbée et éructa avec virulence : \"Espèce de...\\footnote{\\i{NDLR : sur le tableau, \"s'pice de\".}}\r\n\r\n\\item réponse a : iconoclaste !\r\n\\item réponse b : philistin !\r\n\\item réponse c : bélître !\r\n\\item réponse d : reître !\r\n\\item réponse e : MB\\footnote{Méga Beuuu ; \\i{NDLR : pas Mouvement Brownien !}} !\"\r\n\r\nLa bonne réponse : juste après la pub !\r\n\r\nPetit dessin par-ci, petite équation par-là, la courbe représentant le collier a une équation de la forme $y=\\frac{T_0}{\\mu g} \\cosh(\\frac{\\mu g}{T_0} x)$, $\\mu$ étant la masse linéique du collier, $g$ l'accélération de la pesanteur et $T_0$ la tension s'exerçant sur le collier au point le plus bas.\r\nRéponse finale : les réponses a) à e) sont toutes bonnes, la courbe formée par le collier, aux allures captieuses de parabole, est en fait une chaînette...", "Is_Story": "1", "Accepte": "1" }, { "ID": "79", "Expression": "Lorenzaccio de la banlieue<ENDtitre\r\n\r\n\\i{(Illustration du théorème des accroissements finis, version remix 2009 de Titeuf à Donf)}\r\n\r\nÇa chauffe dans la banlieue, Lorenzaccio - caïd local - est continuellement en proie à des bouffées de chaleur, prémisses d'une andropause prodromique... Il vient de réussir son permis de conduire (au bout de la cinquième fois). Maintenant il veut frimer avec sa décapotable rouge devant les midinettes callipyges en pâmoison extatique. Il propose à une donzelle, disons Cassandre, de venir faire un petit tour :\r\n\"Éh ! Cassandre ! Tu viens faire une virée à l'autre bout du globe ? 3000 km, ça ne prendra que 3 heures !\"\r\n\"Il sort d'où celui-là ? Il se prend pour Ben-Hur sur son char ? Même avec un vent catabatique en poupe, torse au vent (ah, ces maudites bouffées de chaleur !), il ne pourrait pas faire plus de 30 km en 3 heures...\"\r\n\"OK poupée ! Soyons raisonnable, je te propose d'aller à \\i{Donf} à 300 km d'\\i{Ici} en 3 heures.\"\r\nTraçons donc la loi horaire de cette odyssée : on démarre d'\\i{Ici} (origine des axes) pour aller à \\i{Donf} (pointe verticale). Sur la courbe il y a quelques paliers horizontaux : sortie du char des arènes, péages d'autoroutes (via Romana), pauses-pipi, petits marivaudages impromptus par-ci, petites cueillettes sur la bande d'arrêt d'urgence par-là (\"Mignonne, allons voir la rose...\", ah, ce Lorenzaccio, quel plumitif primitif ! Ah oui, aujourd'hui c'est banlieue Culture...), attention : chute de la courbe vers le bas, que vient-il donc de se passer ? Lorenzaccio vient de fumer un pissenlit qui trainait sur la bande d'arrêt d'urgence, il est reparti en marche arrière !!! Puis retour en avant (ouf !) et arrivée à \\i{Donf}.\r\nBilan des courses : 300 km en 3 heures, vitesse moyenne 100 km\/h. Le théorème des accroissements finis stipule qu'il y a eu un instant au moins où la vitesse instantanée était également de 100 km\/h. Tout ça pour ça...\r\n\r\n\\b{Bonus track} : supposons à présent que notre Lorenz ait des soubresauts quantiques en vitesse (un vrai électron libre). La loi horaire tout en restant continue pourrait présenter des points anguleux et le théorème pourrait être mis en capilotade...\r\n\r\nIllustration :\r\n\\begin{itemize}\r\n\\li \\image[La version originale]{\/Ressources\/LorenzSud.png}\r\nVersion originale : sortie de l'arène, entrée du péage, pause pipi et marivaudage, cueillaison de pissenlits hallucinogènes, regain de lucidité, sortie du péage et arrivée à Donf.\r\n\r\n\\image[Version quantique]{\/Ressources\/LorenzSudQuantique.png}\r\nVersion quantique (enfin, un peu) : sortie de l'arène, piqûre d'hippobosque analeptique, asthénie et apocatastase ataraxique.\r\n\\end{itemize}", "Is_Story": "1", "Accepte": "1" }, { "ID": "80", "Expression": "Lorenzaccio Banlieue Nord<ENDtitre\r\n\\i{(\\l[http:\/\/lachal.neamar.fr\/Hist-79]{suite de Lorenzaccio Banlieue Sud})}\r\n\\i{(Illustration des hypocycloïdes)}\r\n\r\nLorenzaccio (banlieue Sud) est parti en croisade là-haut à Donf (banlieue Nord), véritable oppidum d'arsouilles. Entre vent catabatique et vent anabatique, notre matamore Lolo a pris un chaud et froid au poitrail. Arrivé là-haut, il se retrouve au milieu d'échauffourées, des chars en tout genre brûlent, on a assisté à un méga-autodafé... Il devient urgent pour Lorenzaccio de trouver des écuries pour ranger son char. Mais voilà, à Donf, les écuries sont d'une facture légèrement baroque : box exigus en béton avec porte coulissante... Problème : trouver un box de bonnes dimensions pour ranger le char sans égratignure et sans compresser la Cassandre rangée dans la soute à bagages...\r\nNotons $L$ et $H$ les longueur et hauteur du box, $h$ et $l$ celle de la voiture (char de Ben-Hur). Mise en équation du mouvement de la porte (de hauteur $H$) : c'est une famille de segments de droites, la courbe enveloppe est le graphe de $\\varphi(x)=H-(H^{2\/3}-x^{2\/3})^{3\/2},x\\in[0,H]$. La condition de non-raclement est $\\varphi(L-l)>h$ soit $L>l+(H^{2\/3}-(H-h)^{2\/3})^{3\/2}$.\r\n\r\n\\l[http:\/\/www.wolframalpha.com\/input\/?i=plot+Re%2810-%2810%5E%282%2F3%29-x%5E%282%2F3%29%29%5E%283%2F2%29%29+from+x%3D0..11]{\\image[Graphe de la fonction]{\/Ressources\/Lorenz-nord.png}}", "Is_Story": "1", "Accepte": "1" }, { "ID": "81", "Expression": "Remake du collier de Diddlina<ENDtitre\r\n(\\l[http:\/\/lachal.neamar.fr\/Hist-53]{\\i{Remake du collier de Diddlina}})\r\n\r\nTiteuf ressent une attirance, que dis-je, une attraction irrépressible envers sa pote Nadia la pulpeuse (terrible les lois de la gravitation, \\i{dura lex sed lex}...).\r\nMais comment suborner la soubrette candide ?\r\nL'histoire des Schtroumpfs nous enseigne que les fleurs marchent à tous les coups (souvenez-vous, les thuriféraires fallacieux).\r\nMais ce n'est pas vraiment le genre de notre pauvre galantin. Soudain jaillit une idée de sa plume qui commence à exsuder : (pourtant ce n'est pas un poète notre Titeuf, il serait plutôt tendance pouêt pouêt camembert, c'est pô possib') : il décide de lui offrir un collier. Il accroche donc le colifichet autour du cou de la donzelle et ne s'empêche de s'exclaffer : \"Damned ! Quelle magnifique parabole !!!\"\r\nÀ ces mots, la Nadia, la vie de sa mère, atrabilaire et revêche, se met à hurler : \"parabole, parabole !!! S'pèce de\r\n\r\nréponse a) : bélître !\r\nréponse b) : philistin !\r\nréponse c) : béotien !\r\nréponse d) : bourrin !\r\n\r\nRéponses complémentaires :\r\ne) MB (méga blaireau) !\r\nf) PB\/PC (pauvre brêêêle, pauvre cloche) !\r\ng) GB (giga bouffon) !\"\r\n\r\nQuelle est la bonne réponse : toutes !!!\r\nMais qu'est-ce qui a bien pu déclencher une telle acrimonie fielleuse ?\r\nCe n'était pas une parabole, mais une chaînette (du latin \\i{catena}, cf. caténaire)...\r\n\r\nMoralité : \"C'est pô juste, j'aurais dû lui offrir une toupie Beyblade...\"", "Is_Story": "1", "Accepte": "1" }]
